create table type
(
    id   serial primary key,
    name varchar
);

create table product
(
    id           serial primary key,
    name         varchar,
    expired_data date,
    price        int,
    type_id      int references type (id)
);

insert into type(name)
values ('СЫР'),
       ('МОЛОКО'),
       ('МОРОЖЕНОЕ'),
       ('ХЛЕБ'),
       ('МАКАРОНЫ');
insert into product(name, expired_data, price, type_id)
values
       ('Мороженое пломбир', '2023-04-18', 15, 3),
       ('Мороженое фруктовое', '2023-01-15', 9, 3),
       ('Мороженое шоколадное', '2022-03-09', 30, 3),
       ('Сыр российский', '2023-04-13', 234, 1),
       ('Сыр голландский', '2023-05-20', 450, 1),
       ('Чечил', '2023-03-01', 612, 1),
       ('Сыр Гауда', '2023-04-29', 2342, 1),
       ('Молоко Деревенское', '2023-04-18', 55, 2),
       ('Молоко Крестьянское', '2023-04-13', 32, 2),
       ('Молоко обезжиренное', '2022-04-16', 45, 2),
       ('Батон', '2023-04-16', 13, 4),
       ('Хлеб Мечта-Пекаря', '2023-04-11', 23, 4),
       ('Хлеб Ржаной', '2023-04-18', 23, 4),
       ('Макароны спагетти', '2024-03-17', 145, 5),
       ('Макароны рожки', '2024-03-15', 134, 5),
       ('Лазанья листы', '2022-03-15', 325, 5);
